# Brewfile
# Install with: brew bundle --file=Brewfile

# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# ================================
# Core CLI Tools
# ================================
brew "bat"                    # Better cat
brew "coreutils"
brew "curl"
brew "fd"                     # Better find
brew "fzf"                    # Fuzzy finder
brew "gh"                     # GitHub CLI
brew "git"
brew "git-delta"              # Better git diff
brew "gnu-sed"
brew "grep"
brew "httpie"
brew "jq"
brew "mas"                    # Mac App Store CLI
brew "neovim"
brew "ripgrep"
brew "shellcheck"
brew "starship"               # Prompt
brew "tmux"
brew "tree"
brew "wget"
brew "zoxide"                 # Better cd
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "direnv"

# ================================
# Development
# ================================
brew "nvm"                    # Node version manager
brew "bun"                    # JS runtime/bundler

# ================================
# AWS
# ================================
brew "awscli"

# ================================
# Casks - Applications
# ================================
cask "alfred"
cask "firefox"
cask "flameshot"
cask "google-chrome"
cask "keepingyouawake"
cask "microsoft-teams"
cask "obsidian"
cask "orbstack"               # Docker alternative
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "wezterm"
cask "zed"

# ================================
# Fonts (Nerd Fonts for terminal/editor icons)
# ================================
cask "font-jetbrains-mono-nerd-font"  # Primary coding font
cask "font-fira-code-nerd-font"       # Alternative with ligatures
cask "font-hack-nerd-font"            # Clean monospace
cask "font-monaspace"                 # Variable font family

# ================================
# Mac App Store (via mas)
# ================================
mas "Tadam", id: 531349534
mas "Todoist", id: 585829637
